# リポジトリ運用ガイドライン

プロジェクトに参加していただきありがとうございます。
このリポジトリを運用するにあたり、以下の項目をご確認いただけると幸いです。


## Issue

- Issueの追加は、同様のものがないか確認してからお願いします。
- 1つのIssueには1つのタスクのみを含めるようにしてください。
- `help wanted` や `high priority` のラベルがついたIssueを優先していただけると幸いです。
- このリポジトリにまだ慣れていない方は、`good first issue` のラベルがついたIssueから対応することをおすすめします。
- `pending` のラベルがついたIssueは保留中なので、実装は避けてください。


## Pull Request

- Issueへのリンクを記入するようお願いいたします。
- テストが通ることを確認してから Pull Request を作成してください。
- 見た目の変更がある場合はスクリーンショットを貼るようお願いいたします。
- 対応方法が不明な場合はIssueで相談してください。
- サポートが必要な場合は Draft Pull Request かIssueで相談してください。


## 開発環境構築手順

開発環境構築手順を記載します。

### 依存関係

依存関係を記載します。

- [tool1](#)
- [tool2](#)


### コマンド

コマンドを記載します。

```sh
# 依存ライブラリのインストール
foo install

# デバッグビルド
foo dev

# 本番ビルド
foo build

# テスト
foo test
```


## 開発フロー

開発フローを記載します。

1. foo
2. bar
3. baz


### 主なブランチ

主なブランチとその役割を記載します。


### ルール

ルールを記載します。

- レビュアー
- マージ条件
- レビューコメント
- その他


## 参考情報

- [開発者向けドキュメント](doc/dev/)
- [プロジェクト情報](../sample_project/)
- [本番環境](https://example.com)
- [ステージング環境](https://stg.example.com)
- [開発環境](https://dev.example.com)
