# 要求仕様書

## `カテゴリID` [カテゴリ]

### `要求ID` 要求

- 理由
    - 理由を記載します。（必須）
- 説明
    - 説明を記載します。（任意）
- 優先度
    - 優先度（高/中/低）を記載します。
- ユーザクラス
    - ユーザクラスを記載します。

<`仕様グループID` 仕様グループ>

- `仕様ID` 仕様
    - 説明
        - 説明を記載します。（任意）
        - 必要に応じて図や表を使います。
    - ステータス
        - ステータス（提案中/承認済/設計済/実装済/検証済）を記載します。


### `親要求ID` 親要求

- 理由
    - 理由を記載します。（必須）
- 説明
    - 説明を記載します。（任意）
- 優先度
    - 優先度（高/中/低）を記載します。
- ユーザクラス
    - ユーザクラスを記載します。


#### `子要求ID` 子要求

- 理由
    - 理由を記載します。（必須）
- 説明
    - 説明を記載します。（任意）

<`仕様グループID` 仕様グループ>

- `仕様ID` 仕様
    - 説明
        - 説明を記載します。（任意）
        - 必要に応じて図や表を使います。
    - ステータス
        - ステータス（提案中/承認済/設計済/実装済/検証済）を記載します。
